demos/http_post/payload.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:c="http://www.niso.org/schemas/counter">
    <Body>
        <ReportRequest xmlns="http://www.niso.org/schemas/sushi/counter">
            <Requestor xmlns="http://www.niso.org/schemas/sushi">
                <ID>[string]</ID>
                <Name>[string]</Name>
                <Email>[string]</Email>
            </Requestor>
            <CustomerReference xmlns="http://www.niso.org/schemas/sushi">
                <ID>28060</ID>
                <Name>[string?]</Name>
            </CustomerReference>
            <ReportDefinition xmlns="http://www.niso.org/schemas/sushi" Name="BR1" Release="4" />
        </ReportRequest>
    </Body>
</Envelope>
