sushicounterclient/trunk/MISO/MISO/bin/Release/SushiSoapEnv.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:coun="http://www.niso.org/schemas/sushi/counter" xmlns:sus="http://www.niso.org/schemas/sushi" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <soap:Header>
        {10}
   </soap:Header>
   <soap:Body>
      <coun:ReportRequest Created="{9}" ID="?">
         <sus:Requestor>
            <sus:ID>{0}</sus:ID>
            <sus:Name>{1}</sus:Name>
            <sus:Email>{2}</sus:Email>
         </sus:Requestor>
         <sus:CustomerReference>
            <sus:ID>{3}</sus:ID>
            <!--Optional:-->
            <sus:Name>{4}</sus:Name>
         </sus:CustomerReference>
         <sus:ReportDefinition Name="{5}" Release="{6}">
            <sus:Filters>
               <sus:UsageDateRange>
                  <sus:Begin>{7}</sus:Begin>
                  <sus:End>{8}</sus:End>
               </sus:UsageDateRange>
            </sus:Filters>
         </sus:ReportDefinition>
      </coun:ReportRequest>
   </soap:Body>
</soap:Envelope>