sample_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:coun="http://www.niso.org/schemas/sushi/counter" xmlns:sus="http://www.niso.org/schemas/sushi">
   <soapenv:Header/>
   <soapenv:Body>
      <coun:ReportRequest Created="?" ID="?">
         <sus:Requestor>
            <sus:ID></sus:ID>
            <sus:Name></sus:Name>
            <sus:Email>example@springer.com</sus:Email>
         </sus:Requestor>
         <sus:CustomerReference>
           <sus:ID>3000093925</sus:ID>
         </sus:CustomerReference>
         <sus:ReportDefinition Name="JR1" Release="4">
            <sus:Filters>
               <sus:UsageDateRange>
                  <sus:Begin>2013-01-01</sus:Begin>
                  <sus:End>2013-06-30</sus:End>
               </sus:UsageDateRange>
            </sus:Filters>
         </sus:ReportDefinition>
      </coun:ReportRequest>
   </soapenv:Body>
</soapenv:Envelope>
